In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import missingno as msno

In [3]:
listings = pd.read_csv("Data/sp500_listings.csv")
listings.head()

         date   stock
0  1990-01-01  905270
1  1990-01-01  921795
2  1990-01-01  904261
3  1990-01-01  905261
4  1990-01-01  916328

In [4]:
info = pd.read_csv("Data/stock_info.csv")
info

,Instrument,MNEM,RIC,ISIN,NAME,ESTAT
0,905270,NaN,NaN,US0318971019,AMP DEAD - MERGER 545615,DEAD
1,921795,NaN,AAMRQ.PK^L13,US0017651060,AMR DEAD - DELIST.09/12/13,DEAD
2,904261,NaN,NaN,US0434131035,ASARCO DEAD - MERGER 18/11/99,DEAD
3,905261,NaN,NaN,US0019575051,AT & T DEAD - DELIST.21/11/05,DEAD
4,916328,U:ABT,ABT,US0028241000,ABBOTT LABORATORIES,ACT.
...,...,...,...,...,...,...
1236,131745,@PENN,PENN.O,US7075691094,PENN NAT.GAMING,ACT.
1237,69487D,@NXPI,NXPI.O,NL0009538784,NXP SEMICONDUCTORS,ACT.
1238,68157P,U:GNRC,GNRC.K,US3687361044,GENERAC HOLDINGS,ACT.
1239,9110RA,@CZR,CZR.O,US12769G1004,CAESARS ENTERTAINMENT,ACT.
1240,292703,U:CRL,CRL,US1598641074,CHAS.RVR.LABS.INTL.,ACT.

In [5]:
prices = pd.read_csv("Data/stock_prices.csv")
prices.head()

,date,905270,921795,904261,905261,916328,923024,936365,902355,912215,...,9889RL,69568X,543755,77463M,29235J,131745,69487D,68157P,9110RA,292703
0,1990-01-02,22.75,12.63,30.00,29.61,3.8736,11.00,4.1250,24.50,58.00,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1990-01-03,22.56,12.57,31.50,29.37,3.8876,11.00,4.0000,24.50,57.75,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1990-01-04,22.38,12.41,32.25,28.89,3.8806,11.38,3.9375,24.63,57.88,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1990-01-05,21.81,12.60,32.13,28.41,3.8387,11.50,3.8125,24.75,57.50,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,1990-01-08,22.25,12.49,32.13,29.13,3.8387,11.50,3.8125,25.00,57.75,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
volumes = pd.read_csv("Data/stock_volumes.csv")
volumes.head()

,date,905270,921795,904261,905261,916328,923024,936365,902355,912215,...,9889RL,69568X,543755,77463M,29235J,131745,69487D,68157P,9110RA,292703
0,1990-01-02,284.8,3153.8,115.1,2845.3,10138.2,8.7,2544.0,121.4,254.9,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1990-01-03,372.2,3292.9,251.0,2405.2,6133.7,6.7,686.8,119.1,285.8,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1990-01-04,508.6,3003.3,185.5,3142.3,6496.6,39.2,944.2,69.4,324.2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1990-01-05,378.0,3682.9,34.8,2679.9,3393.1,4.0,1511.0,24.6,145.2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,1990-01-08,356.6,1999.0,18.7,1897.2,6652.1,4.5,477.0,53.9,176.6,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [7]:
def print_shape(df, dfname):
    print(dfname + " has " + str(df.shape[0]) + " rows and " + str(df.shape[1]) + " columns")
    
dfs = [listings, info, prices, volumes]
dfnames = ["Listings", "Info", "Prices", "Volumes"]
for i in range(len(dfs)):
    print_shape(dfs[i], dfnames[i])

Listings has 188872 rows and 2 columns
Info has 1241 rows and 6 columns
Prices has 7914 rows and 1242 columns
Volumes has 7914 rows and 1242 columns

In [12]:
# Converting listings to binary options

listings["count"] = 1
listings.pivot_table(index="date")

            count
date
1990-01-01      1
1990-02-01      1
1990-03-01      1
1990-04-01      1
1990-05-01      1
...           ...
2021-01-01      1
2021-02-01      1
2021-03-01      1
2021-04-01      1
2021-05-01      1

[377 rows x 1 columns]

In [ ]:
# Changing dates to datetime objects

#def convert_datetime(df):
    #df["date"] = pd.to_datetime(df["date"])

#dfs = [listings, prices, volumes]
#for df in dfs:
    #convert_datetime(df)

In [ ]:
# Converting prices and volumes into a long format

mini_prices = prices.iloc[:,:20]
mini_volumes = volumes.iloc[:,:20]

prices_long = pd.melt(mini_prices, id_vars="date")
volumes_long = pd.melt(mini_volumes, id_vars="date")
prices_long

In [ ]:
# Line plot of first 20 stock prices

sns.set(rc={'figure.figsize':(11.7,8.27)})
sns.lineplot(data=prices_long, x="date", y="value", hue="variable")

In [ ]:
# Line plot of first 20 stock volumes

sns.set(rc={'figure.figsize':(11.7,8.27)})
sns.lineplot(data=volumes_long, x="date", y="value", hue="variable")

In [ ]:
# Looking for missing values

prices.isna().sum()/prices.shape[0] # proportion missing in each column